---
kind: type
id: T:Autodesk.Revit.DB.FilteredElementIdIterator
source: html/dfd0acee-d626-d5b2-fa2a-f9fc4edb49e8.htm
---
# Autodesk.Revit.DB.FilteredElementIdIterator

An iterator to a set of element ids filtered by the settings of a FilteredElementCollector.

## Syntax (C#)
```csharp
public class FilteredElementIdIterator : IEnumerator<ElementId>
```